antrian/app/Controllers/UserCrud.php

    public function list(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function index(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function store() {
        $userModel = new UserModel();
        $data = [
            'name' => $this->request->getVar('name'),
            'email'  => $this->request->getVar('email'),
        ];
        $userModel->insert($data);
---
INSERT INTO `users` (`name`, `email`) VALUES ('FIFI MARSELINA', 'robby280803@gmail.com')

    public function singleUser($id = null){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '12'
 LIMIT 1

    public function delete($id = null){
        $userModel = new UserModel();
        $data['user'] = $userModel->where('id', $id)->delete($id);
---
DELETE FROM `users`
WHERE `id` = '13'
AND `id` IN ('13')

    public function print($id = null)
    {
      $userModel = new UserModel();
      $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '14'
 LIMIT 1

        public function list1(){
            $userModel1 = new UserModel();
            $data1['users1'] = $userModel1->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

        public function singleUser1($id = null){
            $userModel1 = new UserModel();
            $data1['user_obj'] = $userModel1->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '12'
 LIMIT 1

        public function print1($id1 = null)
        {
          $userModel1 = new UserModel();
          $data1['user_obj'] = $userModel1->where('id', $id1)->first();
---
SELECT *
FROM `users`
WHERE `id` = '20'
 LIMIT 1